module.exports = {
    plugins: [
      [
        "postcss-preset-env",
        {
          // Options
        },
      ],
    ],
  };
//   البلجن ده بنحطه بالطريقة دي او بنحطه في الملف التاني عادي بطريقة اخري وهنا ده ملف كونفج جديد استخدمناه عشان نحط الاعدادات دي فيه 
// وكدة اللي حيحصل ان بوست سي اس اس لودر حيدور علي الملف ده ويترجم اللي جواه وهو استخدام البلجن اللي جواه اللي بيحول شفرات سي اس اس الحديثة الي تقليدية يفهمها المتصفح والبلجن ده بردو بيشمل بلجن تاني اللي بيكون ليه ميزة انه بيضيف شوية بادئات قبل تنسيقات معينة عشان تتماشي مع مختلف المتصفحات والبجن ده اسمه autoprefixer