import "./assets/sass/style.scss";
import "normalize.css/normalize.css";
// والمكتبة دي ممكن نضمنها كملفات css جوا ملف ال base بملف بالاسم نورماليز
//احيانا لما بنيجي نعمل ديف ونديلها نوع خط معين ومثلا الديف دي جواها كلام وفي في الديف دي زرار حنلاحظ ان في بعض المتصفحات نوع خط الزرار غير الخاص بالديف اللي هو فيها والسبب ان المتصفح بيحط قيمة افتراضية للخط مثلا للعناصر اللي انا محددتلهاش هي بالذات نوع الخط والحل اننا حنستخدم مكتبة حتوحد التنسيقات في جميع المتصفحات بعض النظر عن القيمة اللي في المتصفح وهي مكتبة نورماليز
